# %% [markdown]
# """Issue Open Source."""
#
# 1. Есть ли у него лицензия? Обычно в корне репозитория находится файл LICENSE.
#     да
# 2. Напишите название понравившейся компании и ссылку на репозиторий
#     Farama Foundation: https://github.com/Farama-Foundation
#     Репозиторий: https://github.com/Farama-Foundation/Gymnasium
# 3. Проект активно принимает стороннюю помощь?
#     Да, мало открыттых пулл-реквестов и очень много закрытых
# 4. Напишите второе улучшение которое вы сделали
#     Улучшение: добавил в readme указание по contributing
# 5. Посмотрите на коммиты в основной ветке, напишите общее количество
#     2510
# 6. Когда был последний коммит?
#     13 часов назад (от 17:00 08.10.2025)
# 7. Сколько контрибьюторов у проекта?
#     463
# 8. Как часто люди коммитят в репозиторий? (На GitHub выяснить это можно, кликнув по ссылке «Commits» в верхней панели.)
#     еженедельно
# 9. Сколько сейчас открытых ишью?
#     72
# 10. Быстро ли мейнтейнеры реагируют на ишью после того, когда они открываются?
#     реакция на новые ишью занимает от одного до пяти дней
# 11. Ведётся ли активное обсуждение ишью?
#     Да, есть длинные ветки диалогов как у открытых, так и у зкарытых ишью
# 12. Есть ли недавно созданные ишью?
#     Да, на прошлой неделе - в начале октября
# 13. Есть ли закрытые ишью? (На странице Issues GitHub-репозитория щелкните на вкладку «Closed», чтобы увидеть закрытые ишью.)
#     Да
# 14. Сколько сейчас открытых пул-реквестов?
#     6
# 15. Быстро ли мейнтейнеры реагируют на пул-реквесты после их открытия?
#     Время ответа от двух дней до недели
# 16. Ведётся ли активное обсуждение пул-реквестов?
#     Да, длинные ветки обсуждений
# 17. Есть ли недавно отправленные пул-реквесты?
#     Да, три недели назад
# 18. Как давно были объединены пул-реквесты? (На странице Pull Request GitHub-репозитория щелкните на вкладку «Closed», чтобы увидеть закрытые пул-реквесты.)
#     13 часов назад (от 17:00 08.10.2025)
#
